#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/posfiap/pos-fiap/runs/run-BdDU3ESSqpH22Px7

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
aws_ecr_repository.repo: Refreshing state... [id=app_repo]
aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-east-1:027260563052:cluster/app_cluster]
aws_cloudwatch_log_group.techchallenge-logs: Refreshing state... [id=awslogs-techchallenge]
aws_iam_role.ecs_execution_role: Refreshing state... [id=ecsExecutionRole]
aws_vpc.vpc: Refreshing state... [id=vpc-08624ff66e48b12d2]
aws_iam_policy_attachment.ecs_execution_role_attachment: Refreshing state... [id=ecsExecutionRoleAttachment]
aws_ecs_task_definition.td: Refreshing state... [id=app]
aws_internet_gateway.gw: Refreshing state... [id=igw-0dbd1e105fa7d0ea3]
aws_subnet.sn2: Refreshing state... [id=subnet-05995c36f7c62dcea]
aws_subnet.sn1: Refreshing state... [id=subnet-061da8cb63b5726b4]
aws_subnet.sn3: Refreshing state... [id=subnet-03bdc84c3d1992b81]
aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:027260563052:targetgroup/app-tg/633b63224cc29782]
aws_security_group.sg: Refreshing state... [id=sg-0a6ac22ce3d979269]
aws_security_group.alb_sg: Refreshing state... [id=sg-068766492a8ad22f8]
aws_route_table.rt: Refreshing state... [id=rtb-07eb248529139a36c]
aws_lb.app_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:027260563052:loadbalancer/app/app-lb/cdeedbd640eed980]
aws_route_table_association.route1: Refreshing state... [id=rtbassoc-051fda810a657028e]
aws_route_table_association.route3: Refreshing state... [id=rtbassoc-092b80a9324d37681]
aws_route_table_association.route2: Refreshing state... [id=rtbassoc-0be79844a8c2c040a]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:027260563052:service/app_cluster/app_service]
aws_lb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:027260563052:listener/app/app-lb/cdeedbd640eed980/e547b0f37cd6b499]
aws_security_group.alb_sg: Drift detected (update)
aws_ecs_service.service: Drift detected (update)
aws_lb_target_group.tg: Drift detected (update)
aws_lb.app_lb: Drift detected (update)
aws_lb_listener.front_end: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:027260563052:service/app_cluster/app_service"
        name                               = "app_service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:027260563052:task-definition/app:17" -> "arn:aws:ecs:us-east-1:027260563052:task-definition/app:16"
        # (15 unchanged attributes hidden)

      + load_balancer {
          + container_name   = "app"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb_listener.front_end will be updated in-place
  ~ resource "aws_lb_listener" "front_end" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:027260563052:listener/app/app-lb/cdeedbd640eed980/e547b0f37cd6b499"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:027260563052:targetgroup/app-tg/633b63224cc29782" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.tg must be replaced
-/+ resource "aws_lb_target_group" "tg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:027260563052:targetgroup/app-tg/633b63224cc29782" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/app-tg/633b63224cc29782" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:027260563052:targetgroup/app-tg/633b63224cc29782" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "app-tg"
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ target_type                        = "instance" -> "ip"
        # (8 unchanged attributes hidden)

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @lucassoaresaraujo, Action: `pull_request`*